DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-SUM PIC 9(5) VALUE 0. 
01  WS-COUNTER PIC 9(3). 
PROCEDURE DIVISION.
    PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > 100
        ADD WS-COUNTER TO WS-SUM
    END-PERFORM.
    DISPLAY "Sum: " WS-SUM.
    STOP RUN.